peterlu198/SnowStorm-Robot/stm32f103-hj-car/board/CubeMX_Config/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IRIN_PIN_Pin GPIO_PIN_10
#define IRIN_PIN_GPIO_Port GPIOD
#define Servo_PIN_Pin GPIO_PIN_12
#define Servo_PIN_GPIO_Port GPIOD
#define FRONT_RIGHT_F_PIN_Pin GPIO_PIN_11
#define FRONT_RIGHT_F_PIN_GPIO_Port GPIOC
#define FRONT_RIGHT_B_PIN_Pin GPIO_PIN_0
#define FRONT_RIGHT_B_PIN_GPIO_Port GPIOD
#define BEHIND_RIGHT_F_PIN_Pin GPIO_PIN_4
#define BEHIND_RIGHT_F_PIN_GPIO_Port GPIOD
#define BEHIND_LEFT_F_PIN_Pin GPIO_PIN_6
#define BEHIND_LEFT_F_PIN_GPIO_Port GPIOD
#define BEHIND_LEFT_B_PIN_Pin GPIO_PIN_9
#define BEHIND_LEFT_B_PIN_GPIO_Port GPIOG
#define FRONT_LEFT_B_PIN_Pin GPIO_PIN_11
#define FRONT_LEFT_B_PIN_GPIO_Port GPIOG
#define FRONT_LEFT_F_PIN_Pin GPIO_PIN_13
#define FRONT_LEFT_F_PIN_GPIO_Port GPIOG
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
